//1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.
// const str = ['a', 'b', 'c'];
// const num = [1, 2, 3];
// const array = str + num;
// console.log(array);

// 2) Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3. (через push и через splice)
// const array = ['a', 'b', 'c'];
// array.push( 1, 2, 3);
// console.log(array);
// //--
// const array1 = ['a', 'b', 'c'];
// array1.splice( 3, 0,  1, 2, 3);
// console.log(array1);


// 3) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].
// const array = [1, 2, 3, 4, 5];
// array.splice( 1, 2);
// console.log(array);

// 4) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// const array = [1, 2, 3, 4, 5];
// array.splice( 3, 0, 'a', 'b' ,'c');
// console.log(array);

// 5) Дан массив const arr = [1, 2, 3, 4, 5]. Создать новый пустой массив arr1. Обойти массив arr через цикл for, каждый элемент массива arr умножить на 10 и результат положить в массив arr1.
// const arr = [1, 2, 3, 4, 5];
// const arr1 = [];
// for (let i = 1; i <=arr.length; i++){
//     let lol = i *10;
//     arr1.push(lol);  }
//
// console.log(arr1);



// 6) Вывести числа от 4 до 400 на экран.
// const arr1 = [];
// for (let i = 4; i <= 400; i++) {
//     arr1.push(i);}
// console.log(arr1);

// 7) Вывести числа в последовательности: 4 7 10 13 с помощью цикла.
// const arr1 = [];
// for (let i = 4; i < 14; i +=3 ) {
//     arr1.push(i);}
//  console.log(arr1);

// 8) Вывести числа 654 653 652 до нуля.

// const array = [];
// for (let i = 0; i <= 654; i++ ) {
//     array.push(i);
//    array.reverse();}
// console.log(array);

// 9) Вывести все годы с 1983 до 2017.
// const arr1 = [];
// for (let i = 1983; i <= 2017; i++) {
//     arr1.push(i);}
//  console.log(arr1);

// // 10) Вывести числа -4 -2 0 2 4 6 ...100.
// const arr1 = [];
// for (let i = -4; i <= 100; i++) {
//        arr1.push(i);}
//   console.log(arr1);
//
// // 11) Найти сумму чисел от 0 до 100 (включительно). (0+1+2+3+4+5)
// let kek = 0;
// for (let i = 0; i <= 100; i++) {
//     kek = i + kek;
// }
// alert(kek);

// 12) Заполните массив следующим образом: в первый элемент запишите 'x',
//  во второй 'xx', в третий 'xxx' и так далее. Длину массива вводить через prompt.
// let lol = prompt();
// let arr1 = [];
// kek = 'x';
// for (let i = 0; i < lol; i++){
//     arr1.push(kek);
//     kek += 'x';}
// console.log(arr1);


// 13) Заполните массив следующим образом: в первый элемент запишите '1',
//  во второй '22', в третий '333' и так далее. Длину массива вводить через prompt.
// let lol = prompt();
// let arr1 = [];
// for (let i = 1; i <= lol; i++){
//     let kek = '';
//     for (let t1 = 1; t1 <= i ; t1++){
//         kek = kek + i;}
//     arr1.push(kek);
// }
// console.log(arr1);




// 14*) нарисовать матрицу x должны быть по краям, 0 в центре. ( длина и высота матрицы не меньше 10 )
// ['x', 'x', 'x', 'x', 'x' 'x', 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 0, 0, 0, 0, 0, 0, 0, 0, 'x']
// ['x', 'x', 'x', 'x', 'x', 'x','x']
//
// let array = [];
// for (let i = 0; i <=9 ; i++){
//     let array1 = [];
//     for (let t = 0; t <=9 ; t++){
//         if (i === 9 || i === 0){
//             array1.push('x')
//         }else if (t === 9 || t === 0){
//             array1.push('x')
//         }else {
//             array1.push('0')
//         }
//     }array.push(array1);
// }
// console.log(array);
//

//
// 15*) нарисовать матрицу (таблица умножения)
// 0: (10) [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// 1: (10) [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
// 2: (10) [3, 6, 9, 12, 15, 18, 21, 24, 27, 30]
// 3: (10) [4, 8, 12, 16, 20, 24, 28, 32, 36, 40]
// 4: (10) [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]
// 5: (10) [6, 12, 18, 24, 30, 36, 42, 48, 54, 60]
// 6: (10) [7, 14, 21, 28, 35, 42, 49, 56, 63, 70]
// 7: (10) [8, 16, 24, 32, 40, 48, 56, 64, 72, 80]
// 8: (10) [9, 18, 27, 36, 45, 54, 63, 72, 81, 90]
// 9: (10) [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

// let arr = [];
// for (let i = 1; i <= 10; i++){
//     let arr1 = [];
//     for(let j = 1; j <=10; j++){
//        let number = i * j;
//        arr1.push(number) ;
//     }arr.push(arr1);
// }console.log(arr);



// 16*)	Написать программу которая будет склонять слово
// 	“товар” в зависимости от количества товаров в корзине.
// 	Например 1 - товар, 4 - товара, 6 - товаров.


// str1 =' товар';
// str2 =' товара';
// str3 =' товаров';
//
// let number = prompt('Корзина');
// num = number % 100;
// number1 =num % 10;
// if (num > 10 && num <20){
//     alert(number + str3);
// }else if(number1 > 1 && number1 < 5){
//     alert(number + str2)
// }else if(number1 === 1){
//     alert(number + str1)
// }else{
//     alert(0 + str3)
// }
